cases/Chapter_6/OC6_III/pitchL37/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear 0.333;
    grad(U)         cellMDLimited Gauss linear 1;
}

divSchemes
{
    default                         none;
    div(phi,U)                      bounded Gauss linearUpwind grad(U);
    div(phi,k)                      bounded Gauss upwind;
    div(phi,epsilon)                bounded Gauss upwind;
    div(phi,R)                      bounded Gauss upwind;
    div(R)                          Gauss linear;
    div(phi,nuTilda)                bounded Gauss upwind;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited corrected 0.333;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected 0.333;
}

fluxRequired
{
    default             no;
    p;
}


// ************************************************************************* //
