cases/Chapter_6/OC6_III/pitchL37/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables

actions
(
    /*
    {
        name    turbine;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            type searchableBox;
            min (-0.9 -0.9 -0.82);
            max (1.3 0.9 0.8);
        }
    }
    */
    
    {
        name 	turbine;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
            p1 (#calc "-0.15*$D" 0 $hub_h);
            p2 (#calc "0.15*$D" 0 $hub_h);
            radius #calc "1.25*$D/2"; 
        }
    }
    /*
    {
        name 	turbine;
        type	cellSet;
        action	add;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
            p1 (0.14 0 -0.82);
            p2 (0.14 0 0);
            radius 0.1;
        }
    }
    */
    {
        name    turbine;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine;
        }
    }
);

// ************************************************************************* //
